Revit 2027 API
InitialColor Class
 This class is the base class for calculating initial light color.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.InitialColor
 Autodesk.Revit.DB.Lighting.CustomInitialColor
 Autodesk.Revit.DB.Lighting.PresetInitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class InitialColor : IDisposable
Public Class InitialColor
	Implements IDisposable
public ref class InitialColor : IDisposable
type InitialColor =
    class
        interface IDisposable
    end
The InitialColor type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
TemperatureValue |  The light color temperature value in Kelvins.
Top
Methods
Name | Description
Clone |  Creates a copy of the InitialColor derived object.
Dispose | Releases all resources used by the InitialColor
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace